hotRoom10_snappy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       527100;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       533100;
    }
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       539100;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       540000;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6000;
        startFace       540900;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6000;
        startFace       546900;
    }
)

// ************************************************************************* //
